In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [3]:
df1 = DataFrame([[3.4,np.nan],[5.7,-2.8],
               [np.nan,np.nan],[0.33,-0.6]],
               index=list('abcd'), columns=['One','Two'])
df1b

    One  Two
a  3.40  NaN
b  5.70 -2.8
c   NaN  NaN
d  0.33 -0.6

In [4]:
df1.sum()

One    9.43
Two   -3.40
dtype: float64

In [5]:
df1.sum(axis=1)

a    3.40
b    2.90
c     NaN
d   -0.27
dtype: float64

In [6]:
df1.sum(axis=1,skipna=False)

a     NaN
b    2.90
c     NaN
d   -0.27
dtype: float64

In [7]:
df1.count()

One    3
Two    2
dtype: int64

In [8]:
df1.idxmax()

One    b
Two    d
dtype: object

In [9]:
df1.cumsum()

    One  Two
a  3.40  NaN
b  9.10 -2.8
c   NaN  NaN
d  9.43 -3.4

In [10]:
df1.describe()

            One       Two
count  3.000000  2.000000
mean   3.143333 -1.700000
std    2.694185  1.555635
min    0.330000 -2.800000
25%    1.865000 -2.250000
50%    3.400000 -1.700000
75%    4.550000 -1.150000
max    5.700000 -0.600000

In [12]:
ser1 = Series(['a','b','b','c']*4)
ser1

0     a
1     b
2     b
3     c
4     a
5     b
6     b
7     c
8     a
9     b
10    b
11    c
12    a
13    b
14    b
15    c
dtype: object

In [13]:
ser1.describe()

count     16
unique     3
top        b
freq       8
dtype: object

In [14]:
ser2 = Series(list('acdaabbcc'))
ser2

0    a
1    c
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [15]:
ser2.unique()

array(['a', 'c', 'd', 'b'], dtype=object)

In [16]:
ser2.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [17]:
mask = ser2.isin(['b','c'])
mask

0    False
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [18]:
ser2[mask]

1    c
5    b
6    b
7    c
8    c
dtype: object

In [19]:
str_data = Series(['笔记本','手机', np.nan,'家电'])
str_data

0    笔记本
1     手机
2    NaN
3     家电
dtype: object

In [20]:
str_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [21]:
str_data.dropna()

0    笔记本
1     手机
3     家电
dtype: object

In [22]:
str_data[str_data.notnull()]

0    笔记本
1     手机
3     家电
dtype: object

In [23]:
df1

    One  Two
a  3.40  NaN
b  5.70 -2.8
c   NaN  NaN
d  0.33 -0.6

In [24]:
df1.dropna()

    One  Two
b  5.70 -2.8
d  0.33 -0.6

In [25]:
df1.dropna(how='all')

    One  Two
a  3.40  NaN
b  5.70 -2.8
d  0.33 -0.6

In [26]:
df2 = DataFrame([[12,6.3,7.2],[1.5,np.nan,np.nan],
                [np.nan,np.nan,np.nan],[np.nan,4.4,3.7]])
df2

      0    1    2
0  12.0  6.3  7.2
1   1.5  NaN  NaN
2   NaN  NaN  NaN
3   NaN  4.4  3.7

In [29]:
df2.fillna(value=0)

      0    1    2
0  12.0  6.3  7.2
1   1.5  0.0  0.0
2   0.0  0.0  0.0
3   0.0  4.4  3.7

In [30]:
f_value = {0:0.2,2:0.5}
df2.fillna(value=f_value)

      0    1    2
0  12.0  6.3  7.2
1   1.5  NaN  0.5
2   0.2  NaN  0.5
3   0.2  4.4  3.7